{
  "main": {
    "name":"Gautam Chatterjee",
    "occupation":"Full Stack Developer",
    "description":"I am a rising Junior at UMass Amherst majoring in Computer Science and Mathematics. Looking for Software Engineering Internships for Summer 2022",
    "bio":"I am a rising Junior at the University of Massachusetts Amherst, majoring in Computer Science and Mathematics. I have spent a lot of time building scalable, full stack, web applications both inside and outside the class. I have experience designing and building applications using technologies like Node, React, Express and MongoDB.",
    "contactmessage":"Send me a message!",
    "email": "gchatterjee@umass.edu",
    "phone": "+91 78995 09505",
    "address":{
      "street":"University of Massachusetts Amherst, 160 Clark Hill Rd",
      "city":"Amherst",
      "state":"MA",
      "zip": "01002"
    },
    "website": "http://www.timbakerdev.com",
   "resumedownload":"",
    "social":[
    
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/gautam-chatterjee-993a411a3/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/Gautam-Chatterjee",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"University Of Massachusetts at Amherst",
        "degree":"Bachelors in Computer Science and Mathematics",
        "graduated":"Expected May 2023",
        "description":"At Umass, I am an active member of the UMass ACM Machine Learning club and the Umass DSC. This summer I worked as an Undergraduate Research Assistant at CICS, working on solving Fair Allocation problems using Neural Networks under doctoral student Justin Payan. I will be starting my position as an Undergraduate Teaching Assitant for CS 320, The undergraduate Software Engineering Course at Umass Amherst starting Fall 2021."}],
    "work":[
      {"company":"College Of Information and Computer Sciences",
        "title":"Undergraduate Research Assistant",
        "years":"May 2021- July 2021",
        "description": "Worked on Fair Allocation Problems with Doctoral Student Justin Payan using Neural Networks. Used Deep Learning tool PyTorch to train a neural network to search over probabilistic allocations and arrive at adeterministic allocation. Used the Neural Network to maximize ”welfare” and minimize ”envy”.Performed experiments with the mallows model with 50 agents and 100 goods which showed a linear increase in welfarewith decreasing entropy of the probabilistic distributions, Entropy ranged from 0.15 - 0.95."},
      {
        "company":"Project ReachOut",
        "title":"Software Developer",
        "years":"June 2020 - August 2020",
        "description":"Part of a team of students developing an appointment making application for the College of Information and Computer Sciences using React, Node and AWS. We aimed to streamline the process of scheduling appointments for both students and advisors by creating a visually appealing and intuitive interface while ensuring scalability."
      },
      {
        "company":"AVI Networks",
        "title":"Software Development Intern",
        "years":"March 2018 - July 2018",
        "description":"Built a web application with a search system to view employee records given any field such as location, designation, name etc. AVI Networks had its teams spread across the world and a means was needed to find the people with the right skills in a rapidly growing company to ensure the most efficient use of company resources. I made use of relational database systems to ensure fast lookup times. This application was built using HTML, CSS, SQL and python."
      },
      {
        "company":"Teach for India",
        "title":"English and Mathematics Teacher",
        "years":"November 2018 - March 2019",
        "description":"Taught underprivileged children of grades 4-5 English and Mathematics to prepare them for state level exams which they needed to pass to be promoted to the next grade. I was responsible for planning lessons, homework assignments and administering practice tests in the weeks following up to the finals."

      }
    ],
    "skills":[
      {
        "name":"JavaScript",
        "level":"90%"
      },
      {
        "name":"Java",
        "level":"80%"
      },
      {
        "name":"Python",
        "level":"70%"
      },
      {"name":"C",
      "level":"50%"},

      {
        "name":"React.js",
        "level":"50%"
      },
      {
        "name":"Node.js",
        "level":"80%"
      },
      {
        "name":"AWS",
        "level":"50%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      },{
        "name":"Kafka",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Rescue Coordinator (HackUmass 2020):",
        "category":"Coordinates thousands of rescue workers in the event of a large scale natural disaster.",
        "image":"rescue.png",
        "url":"https://github.com/rahulgajawada/RescueWorkerApp"
      },
      {
        "title":"Discord Moderation Bot",
        "category":"Bot developed using Discord.js to moderate and cater to the needs of a server of computer science students.",
        "image":"discord.png",
        "url":"https://github.com/Gautam-Chatterjee/DiscordBot"
      },
      {
        "title":"Interpreter for Toy Language",
        "category":"Interpreter written in JavaScript for a language resembling python.",
        "image":"Interpreter.png",
        "url":"https://github.com/Gautam-Chatterjee/DiscordBot"
      },
      {
        "title": "Ethisim",
        "category": "Ethisim is an ethics simulator that allows users to build a situation, include stakeholders and generate a simulation",
        "image":"ethisim.png",
        "url": "https://github.com/david-fisher/320-S21-Track2"
      },
      {
        "title": "Fair-Allocation",
        "category": "Neural Network used to solve Fair Allocation Problems, tested with probabilistic distribituions generated by the Mallows model",
        "image":"fair-allocation.png",
        "url": "https://github.com/Gautam-Chatterjee/Fair-Allocation/tree/main"
      }
      
    ]
  },
  "testimonials":{
    "testimonials":[
      
    ]
  }
}
